Revit 2018 API
Rebar.MultiplanarDepth Property
 For a multiplanar rebar, the depth of the instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2009
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().MultiplanarDepth property instead.")]
public double MultiplanarDepth { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().MultiplanarDepth property instead.")> _
Public Property MultiplanarDepth As Double
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().MultiplanarDepth property instead.")]
public:
property double MultiplanarDepth {
	double get ();
	void set (double value);
}
Remarks
 Applicable only when an instance of a RebarShape with a RebarShapeMultiplanarDefinition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: multiplanarDepth must be positive.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  This Rebar is not an instance of a multiplanar shape. -or- This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace